read_verilog btog.v
prep -top btog
show -format svg -prefix btog_map
